/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: budelphi <budelphi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/01/21 14:58:16 by budelphi          #+#    #+#             */
/*   Updated: 2021/02/13 20:07:31 by budelphi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "include/cub3d.h"

/*
** Что делает программа:	Программа Cub3D является простейшей
**							RayCasting программой, которая
**							отрисовывает лабиринт
**							заданный в файле с расширением .cub
**
** Возвращаемое значение:	' 0'	- Завершение программы/ф-ции.
**							'-1'	- Ошибка.
**
** Особенности:				Для работы с программой используется
** 							специальная библиотека miniLibX,
** 							которая использует framework OpenGL.
*/

int		main(int ac, char **av)
{
	ft_putstr("\n--> PROGRAM START!\n");
	ft_cub3d(ac, av);
	return (0);
}
