/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_cub3d.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: budelphi <budelphi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/01/20 20:26:50 by budelphi          #+#    #+#             */
/*   Updated: 2021/02/13 23:19:04 by budelphi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../include/cub3d.h"

/*
** Что делает программа:	Программа Cub3D является простейшей
**							RayCasting программой, которая
**							отрисовывает лабиринт
**							заданный в файле с расширением .cub
**
** Возвращаемое значение:	' 0'	- Завершение программы/ф-ции.
**							'-1'	- Ошибка.
**
** Дополнительно:			Все ошибки можно узнать в README.md.
**
** Особенности:				Для работы с программой используется
** 							специальная библиотека miniLibX,
** 							которая использует framework OpenGL.
*/

int	ft_cub3d(int ac, char **av)
{
	t_all	all;
	int		res;

	res = 0;
	res = ft_init_all_struct(&all);
	res = (res != -1 ? ft_parser(ac, av, all.cub) : res);
	res = (res != -1 ? ft_is_valid(all.cub) : res);
	res = (res != -1 ? ft_get_mlx(all.mlx, all.cub) : res);
	res = (res != -1 ? ft_cub_2d(&all) : res);
	exit(0);
	return (res);
}
